app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    @movies = Movie.all

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @movie = Movie.find(id)

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "teste"], ["rating", "G"], ["release_date", "2021-08-27 00:00:00"], ["created_at", "2021-08-27 21:55:11.712654"], ["updated_at", "2021-08-27 21:55:11.712654"]]
---
  def create
    #@movie = Movie.create!(params[:movie]) #did not work on rails 5.
    @movie = Movie.create(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]
---
  def destroy
    @movie = Movie.find params[:id]
    @movie.destroy